import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","name","name_cn","iconGuid","guid","colorIndex","price","installArea","type","isMartial","martialId","isInteract"],["","","","","","","","","","","",""],[1,"木凳","木凳","179615","E1DB4CC34B7D8C3055F5A6AF3798F75A",0,0,"1",5,0,null,null],[2,"木椅","木椅","179582","16DE9C604425B47ED94753B9ED282423",0,5,"1",5,0,null,null],[3,"圆凳子","圆凳子","179570","6440B954402A4586F14D1B972B794639",0,10,"1",5,0,null,null],[4,"沙发椅","沙发椅","179610","D14C3DC343CE3F209C76BD89C567CCC7",0,20,"1",5,0,null,null],[5,"躺椅","躺椅","179613","0065AD6540BC4F9F90216F90B52E909C",0,30,"1",5,0,null,null],[6,"榻榻米椅","榻榻米椅","179596","32C08BDB441E8FCECF07C6B88969C82D",0,30,"1",5,0,null,null],[7,"吊椅","吊椅","179592","A268261E4E04BE4FD3989BADC2C0A02C",0,40,"1",5,0,null,null],[8,"太师椅","太师椅","179600","48D798F444177DB73BAE4A9D4636FB64",0,60,"1",5,0,null,null],[9,"公园木椅","公园木椅","179560","531795364EF51A44B3213AA143F7FD68",0,100,"1",5,0,null,null],[10,"红色长椅","红色长椅","179588","272573044E0FA18D1CDAE78F6EE96CD3",0,100,"1",5,0,null,null],[11,"休息椅","休息椅","179564","0C5D2083490B41AB7DAA8F9963397BD2",0,150,"1",5,0,null,null],[12,"沙滩躺椅","沙滩躺椅","179602","A3DF8D5F4A3AF1014E3F39B95F6F72D7",0,200,"1",5,0,null,null],[13,"单人床","单人床","179561","6E82ECEF424804E95FD4EBB554CDEC91",0,0,"1",4,0,null,null],[14,"双人床","双人床","179586","BE9846734575C637D9B05B854D6B34F8",0,5,"1",4,0,null,null],[15,"高低床","高低床","179576","C42D36DB421B689D7AEF1D80C0AF0226",0,10,"1",4,0,null,null],[16,"婴儿床","婴儿床","179598","A7F970FB4FDBE30CE824D79C7C73F40A",0,20,"1",4,0,null,null],[17,"儿童床","儿童床","179619","485EBC95440BDF2562455DB6F26ADA89",0,20,"1",4,0,null,null],[18,"气垫床","气垫床","179605","4A7043954C0A258B9424E3837D1758DA",0,30,"1",4,0,null,null],[19,"公主床","公主床","179587","137C213C4A12D21F8BA61A9FBFC8E6ED",0,80,"1",4,0,null,null],[20,"古代床","古代床","179562","25AAB2DA4D1E1ADD6761B383E981B662",0,150,"1",4,0,null,null],[21,"储物柜","储物柜","179604","2C16938B44261395D2ED928B73DA4266",0,0,"1",6,0,null,null],[22,"床头柜","床头柜","179593","BB40075746480C5EEB1DB7BA8377FAA9",0,5,"1",6,0,null,null],[23,"木制三层书架","木制三层书架","179563","F8ADAE1747F1D28DC8BDCC8D138E1D26",0,10,"1",6,0,null,null],[24,"置物架","置物架","179599","15EF6067489C74029D7793AF9910538A",0,10,"1",6,0,null,null],[25,"红木柜子","红木柜子","179567","7471D42E45A45BE1C8A30D88F716ED7F",0,15,"1",6,0,null,null],[26,"红木衣柜1","红木衣柜1","179581","7595B61B4A6E66DF98D8B0A39B40CF75",0,20,"1",6,0,null,null],[27,"红木衣柜2","红木衣柜2","179589","E5FBCF1B4817EDE4F90199B704A6C5B2",0,20,"1",6,0,null,null],[28,"红酒柜","红酒柜","179584","70404092458D353E8359649673A29ABA",0,50,"1",6,0,null,null],[29,"高级床头柜","高级床头柜","167303","134C47ED4C161DEB72525CBAA5FB7EE6",0,100,"1",6,0,null,null],[30,"高级书架","高级书架","179590","0200A1014C01781F253A76AEA906FD2D",0,120,"1",6,0,null,null],[31,"高级中式架","高级中式架","179569","1C3B57CB47F990F0763243B63E516208",0,180,"1",6,0,null,null],[32,"洗衣机","洗衣机","179583","A06EC79947BF5D2DE3FB6CA47F2124E9",0,0,"1",10,0,null,null],[33,"浴缸","浴缸","167303","7D4209F544B4BB9DEDBC4088307DC46D",0,5,"1",10,0,null,null],[34,"淋浴","淋浴","179603","FB1E46624026E2CB11785CA86F75203F",0,10,"1",10,0,null,null],[35,"滚筒洗衣机","滚筒洗衣机","179575","454B88B140E69B737C1253B49D586B7F",0,10,"1",10,0,null,null],[36,"马桶1","马桶1","179573","1E0D5F1148885222FD77AD98754EC71A",0,15,"1",10,0,null,null],[37,"马桶2","马桶2","179559","A892D57340784CBF26144891F3ADDE13",0,15,"1",10,0,null,null],[38,"高级浴缸","高级浴缸","179606","FC4BEDC6473A679CF9E3189F59A308F4",0,80,"1",10,0,null,null],[39,"仙人掌","仙人掌","167303","4D49115D41770786E76DF5BDE012A114",0,0,"1",9,0,null,null],[40,"南瓜头","南瓜头","179594","975BA2774B6DE275015E35BE894F4981",0,5,"1",9,0,null,null],[41,"海星","海星","167303","A0D9DE8D462999820C645BB02D54986C",0,10,"1",9,0,null,null],[42,"箭靶","箭靶","179566","356ECB82463DE99E7CB2E2803DB8E7AF",0,15,"1",9,0,null,null],[43,"盆栽1","盆栽1","179616","15CE07D54CB46B9BF2C44AB49C039DAF",0,20,"1",9,0,null,null],[44,"盆栽2","盆栽2","179577","5DC75F1A409403B50E59ECAD5F76C1DD",0,20,"1",9,0,null,null],[45,"篝火","篝火","179591","B2A79A1A4F9775CD42BBBEB43CE05407",0,30,"1",9,0,null,null],[46,"钢琴","钢琴","179574","877BC0F34FB0723010D93FBA297C7A85",0,40,"1",9,0,null,null],[47,"雪人","雪人","179601","5B3C45354B1E0A5BC56ECC83C8CCECD0",0,60,"1",9,0,null,null],[48,"圣诞树","圣诞树","179620","84FBC9D84407FB28328375AA28E708AB",0,100,"1",9,0,null,null],[49,"小白兔","小白兔","179607","00F2CEE440DBD7A44E2DA189B3E41DE4",0,0,"1",8,0,null,null],[50,"漂浮猫猫","漂浮猫猫","179579","8CF82C084C4F4A9CE4EE0496B276F82C",0,5,"1",8,0,null,null],[51,"小绿龙","小绿龙","179618","91C1D0D4419F2403E7302195EB206753",0,10,"1",8,0,null,null],[52,"长耳朵小人","长耳朵小人","179612","0AE4E1B3435F55BB7F15758054F2EC78",0,15,"1",8,0,null,null],[53,"黄色小狗","黄色小狗","179568","903B840C4268ACFDE6E1AAB6ED83E860",0,15,"1",8,0,null,null],[54,"开心幽灵","开心幽灵","179608","0249B0AF4B107D4895D0EF989D11DBA0",0,20,"1",8,0,null,null],[55,"索尼克","索尼克","179572","D29A080B42F7E930EFAA29991B54A31E",0,40,"1",8,0,null,null],[56,"冰淇淋兔几","冰淇淋兔几","179609","428DB2944B0F542CB83531B9C739F50E",0,50,"1",8,0,null,null],[57,"飞行企鹅","飞行企鹅","179597","ABEC890D4839B66F22198F8612D358B6",0,60,"1",8,0,null,null],[58,"小木桌","小木桌","179595","082B408242C0EA59DD31B986521BD25A",0,0,"1",7,0,null,null],[59,"云纹桌","云纹桌","179580","B8670B584732252FCE37B1B99E070988",0,10,"1",7,0,null,null],[60,"小茶几","小茶几","179571","0AE9A8DB4E0F2759BB4BA090D40E33E8",0,10,"1",7,0,null,null],[61,"书桌","书桌","179617","25F8F99B41777AD1D7837F94DE6BEA53",0,15,"1",7,0,null,null],[62,"大圆桌","大圆桌","179565","34D0E6F84E48541B1B30FF83B494C3DD",0,30,"1",7,0,null,null],[63,"蔬菜桌","蔬菜桌","179614","44FE228441AF6A471B6465AA0061C11D",0,50,"1",7,0,null,null],[64,"野餐桌","野餐桌","179578","8C033C0044C99D6C82A5BABFB1ADA095",0,60,"1",7,0,null,null],[65,"木制亭子","木制亭子","179611","9D794D704A9B035D4479FDBE5A6116C5",0,200,"1",7,0,null,null]];
export interface IHomeDressElement extends IElementBase{
 	/**id*/
	id:number
	/**名称*/
	name:string
	/**中文名*/
	name_cn:string
	/**图标Guid*/
	iconGuid:string
	/**物品guid*/
	guid:string
	/**换色材质索引*/
	colorIndex:number
	/**价格*/
	price:number
	/**安装区域*/
	installArea:string
	/**二级分类*/
	type:number
	/**是否材质*/
	isMartial:number
	/**材质id*/
	martialId:string
	/**是否可交互*/
	isInteract:boolean
 } 
export class HomeDressConfig extends ConfigBase<IHomeDressElement>{
	constructor(){
		super(EXCELDATA);
	}

}