import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","MusicGUID","Music","MusicRange"],["","","",""],[1,"117511",1,null,"按钮点击正确的音效"],[2,"29187",1,null,"按钮点击错误的音效"],[3,"13937",1,null,"游戏的BGM（废弃）"],[4,"29189",1,null,"记忆图片小游戏开始答题的提示音."],[5,"118362",1,null,"足球课的BGM"],[6,"118364",1,null,"篮球课的BGM"],[7,"119008",1,null,"篮球击中蓝框的音效"],[8,"120837",1,null,"数学课的BGM"],[9,"120838",1,null,"舞蹈课的BGM"],[10,"119008",1,null,"记忆图片成功的音效"],[11,"117511",1,null,"展示图片按钮的音效"],[12,"120840",0.65,null,"音乐课BGM"],[13,"133480",1,null,"BGM"],[14,"124718",1,null,"成绩单出现的音效"],[15,"119008",1,null,"足球射入球门并且得分的音效"],[16,"124714",1,null,"足球射球的音效"],[17,"120849",1,null,"足球滑铲的音效"],[18,"117201",1,null,"鼓音乐"],[19,"117190",1,null,"鼓音乐"],[20,"59399",1,null,"唱歌"],[21,"118711",1,null,"唱歌"],[22,"118697",1,null,"唱歌"],[23,"124713",1,null,"换装音效"],[24,"121544",1,null,"舞蹈音效"],[25,"121542",1,null,"舞蹈音效"],[26,"117601",1,null,"音乐课（贝斯）"],[27,"130727",1,null,"音乐课（萨克斯）"],[28,"130722",1,null,"音乐课（吹笛子）"],[29,"117192",1,null,"音乐课（打鼓）"],[30,"14929",1,null,"音乐课（吉他）"],[31,"47415",1,null,"通用点击音"],[32,"29189",1,null,"道具通用获取音"],[33,"29289",1,null,"检查点到达音"],[34,"135482",1,null,"赛跑庆祝音效"],[35,"145880",1,null,"赛跑准备音效"],[36,"146099",1,null,"派对交互BGM"],[37,"151219",1,null,"夜晚bgm"],[38,"38193",1,null,"夜晚捡到货币的音效"],[39,"106087",0.6,null,"踩到数学课怪物触发器00ADF7FE"],[40,"124976",0.5,null,"踩到计算机课怪物触发器779749A3/踩到图书馆怪物触发器"],[41,"135447",0.5,null,"踩到舞蹈课怪物触发器DF8047A3"],[42,"126340",0.4,null,"踩到美术课怪物触发器55B0FF4C"],[43,"106093",0.5,null,"踩到语言课怪物触发器FEBF7887"],[44,"147341",0.8,null,"派对交互BGM"],[45,"146100",1,null,"派对交互BGM"],[46,"146107",1,null,"派对交互BGM"],[47,"131079",0.7,null,"飞行课BGM"],[48,"119008",1,null,"造物正确音效"],[49,"132972",0.7,null,"造物课BGM"],[50,"34770",1,null,"跳高区域BGM"],[51,"39348",1,null,"跳高区里程碑ui弹出音效"],[52,"120844",1,null,"跳高区顶部音效1"],[53,"132952",1,null,"跳高区顶部音效2"],[54,"12354",1,[0,3000],"击中音效"],[55,"103342",0.7,[0,4000],"怪物自身受击音效1"],[56,"114002",1,[0,3000],"怪物死亡音效"],[57,"121709",1,[0,3000],"风刃命中音效"],[58,"12384",1,[0,3000],"风球爆炸音效"],[59,"162452",1,[0,3000],"鲨鱼雷系击中音效"],[60,"162447",1,[0,5000],"鲨鱼火系击中音效"],[61,"162451",1,[0,5000],"鲨鱼风系击中音效"],[62,"133480",1,null,"占卜牌占卜界面bgm"],[63,"124724",1,null,"占卜牌出现并转圈音效"],[64,"13827",1,null,"占卜牌点击音效"],[65,"137573",1,null,"占卜牌旋转放大到屏幕中间的音效"],[66,"119032",1,null,"占卜牌在屏幕中间站定的音效"],[67,"95728",1,null,"占卜牌面弹窗出现音效"],[68,"27465",1,null,"占卜弹窗音效"],[69,"131830",3,[0,2000],"胜利音效"],[70,"135448",1,[0,600],"酷猫叫"],[71,"164430",0.3,null,"召唤"],[72,"164431",0.3,null,"退出召唤"],[73,"164429",0.3,null,"猫叫"],[74,"165877",1,null,"自习课BGM"],[75,"176101",1,null,"变换天气时切换BGM"],[76,"176103",1,null,"变换天气时切换BGM"],[77,"176098",1,null,"变换天气时切换BGM"],[78,"176102",1,null,"变换天气时切换BGM"],[79,"176101",1,null,"变换天气时切换BGM"],[80,"176100",1,null,"变换天气时切换BGM"]];
export interface IMusicElement extends IElementBase{
 	/**唯一id*/
	ID:number
	/**音效Guid*/
	MusicGUID:string
	/**音量字段*/
	Music:number
	/**播放范围*/
	MusicRange:Array<number>
 } 
export class MusicConfig extends ConfigBase<IMusicElement>{
	constructor(){
		super(EXCELDATA);
	}

}