import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","language","language_C","buildings","taskLineId","taskState","goodWill","nextTalk","playerTalk","jumpTalk","hide"],["","MainLanguage","ChildLanguage","","","","","","","",""],[1,"欢迎来到魔法庄园，这是我赠予最优秀的学生的礼物","你好欢迎来到魔法庄园，这是我赠予最优秀的学生的礼物",null,0,0,0,0,[2],0,0],[2,"是的，优秀的娃。庄园是给你了，想要知道怎么把它变得更漂亮吗？","是的，优秀的娃。庄园是给你了，想要知道怎么把它变得更漂亮吗？",null,0,0,0,0,[3],0,0],[3,"啊呀呀~口好渴啊，你帮我去拿一杯水，我告诉你魔法庄园怎么玩儿！","啊呀呀~口好渴啊，你帮我去拿一杯水，我告诉你魔法庄园怎么玩儿！",null,0,0,0,0,[4],0,0],[4,"水还没来吗？要渴死了~","水还没来吗？要渴死了~",null,0,0,0,0,null,0,0],[5,"能把水给我吗？我都快渴死了~（拜托拜托）","能把水给我吗？我都快渴死了~（拜托拜托）",null,0,0,0,0,[5,6],0,0],[6,"一会学校见","一会学校见",null,0,0,0,0,null,0,0],[7,"先完成其他任务哦","先完成其他任务哦",null,0,0,0,0,null,0,0],[8,"水就在桥对面的桌子上哦，赶紧去拿吧！","水就在桥对面的桌子上哦，赶紧去拿吧！",null,1,1,0,0,null,0,0],[9,"呼呼~舒服了，看到我身后的空地了吗？别眨眼，这是我给你的奖励！","呼呼~舒服了，看到我身后的空地了吗？别眨眼，这是我给你的奖励！",null,1,2,0,0,null,0,0],[10,"诶，同学好面熟，我们好像在魔藤上见过？","诶，同学好面熟，我们好像在魔藤上见过？",null,0,0,0,0,[8],0,0],[11,"有点记不太清了哈哈，不过相见即是缘分，我准备送你1个礼物！","有点记不太清了哈哈，不过相见即是缘分，我准备送你1个礼物！",null,0,0,0,0,[9],0,0],[12,"看到我身后的空地了吗？嘿嘿...但我现在想吃鱼了，能帮我抓点鱼来吗？","看到我身后的空地了吗？嘿嘿...但我现在想吃鱼了，能帮我抓点鱼来吗？",null,0,0,0,0,[10],0,0],[13,"肚子咕咕叫了，想吃鱼","肚子咕咕叫了，想吃鱼",null,0,0,0,0,null,0,0],[14,"好香的鱼，能给我吗？","好香的鱼，能给我吗？",null,0,0,0,0,[11,12],0,0],[15,"谢谢你的鱼，记得来魔藤找我","谢谢你的鱼，记得来魔藤找我",null,0,0,0,0,null,0,0],[16,"先完成其他任务哦","先完成其他任务哦",null,0,0,0,0,null,0,0],[17,"鱼就在我面前的河里，快去抓吧！","鱼就在我面前的河里，快去抓吧！",null,2,1,0,0,null,0,0],[18,"不愧是狸月经常夸奖的好同学！来，你想要什么样式的院子？","不愧是狸月经常夸奖的好同学！来，你想要什么样式的院子？",null,2,2,0,0,null,0,0],[19,"呜呜呜...呜呜呜...小熊好难过...","呜呜呜...呜呜呜...小熊好难过...",null,0,0,0,0,[14],0,0],[20,"小熊想要蝴蝶，好看的蝴蝶。但小熊太笨了，抓不住，呜呜呜...","小熊想要蝴蝶，好看的蝴蝶。但小熊太笨了，抓不住，呜呜呜...",null,0,0,0,0,[15],0,0],[21,"蝴蝶就在不远处的小树林里，你能帮小熊抓来吗？","蝴蝶就在不远处的小树林里，你能帮小熊抓来吗？",null,0,0,0,0,[16],0,0],[22,"蝴蝶，蝴蝶，呜呜呜...","蝴蝶，蝴蝶，呜呜呜...",null,0,0,0,0,null,0,0],[23,"好漂亮的蝴蝶，能给我吗？","好漂亮的蝴蝶，能给我吗？",null,0,0,0,0,[17,18],0,0],[24,"小熊先回家了，下次小熊再来找你玩！","小熊先回家了，下次小熊再来找你玩！",null,0,0,0,0,null,0,0],[25,"先完成其他任务哦","先完成其他任务哦",null,0,0,0,0,null,0,0],[26,"小熊就在这里等你，呜呜...","小熊就在这里等你，呜呜...",null,3,1,0,0,null,0,0],[27,"啊！！好多漂亮的蝴蝶，感谢善良的同学。小熊也送你个礼物！","啊！！好多漂亮的蝴蝶，感谢善良的同学。小熊也送你个礼物！",null,3,2,0,0,null,0,0],[28,"每个魔法师都应该具备一颗魔法之心，那你知道魔法之心是什么吗？","每个魔法师都应该具备一颗魔法之心，那你知道魔法之心是什么吗？",null,0,0,0,0,[20],0,0],[29,"心中石，石中心，坚毅如顽石。明白了吗？","心中石，石中心，坚毅如顽石。明白了吗？",null,0,0,0,0,[21],0,0],[30,"车站旁有一棵树，我把魔法之心藏在那里的，找到它，我送你一份大礼！","车站旁有一棵树，我把魔法之心藏在那里的，找到它，我送你一份大礼！",null,0,0,0,0,[22],0,0],[31,"你是否找到了你的魔法之心？","你是否找到了你的魔法之心？",null,0,0,0,0,null,0,0],[32,"石头你已经带来了？给我看看...","石头你已经带来了？给我看看...",null,0,0,0,0,[23,24],0,0],[33,"等你领悟了魔法之心，我会再来的！","等你领悟了魔法之心，我会再来的！",null,0,0,0,0,null,0,0],[34,"先完成其他任务哦","先完成其他任务哦",null,0,0,0,0,null,0,0],[35,"石堆就在车站旁边的树下，快去吧！","石堆就在车站旁边的树下，快去吧！",null,4,1,0,0,null,0,0],[36,"每个石头都是一样的，重要的不是石头本身，而是心中的石之意志！","每个石头都是一样的，重要的不是石头本身，而是心中的石之意志！",null,4,2,0,0,null,0,0],[37,"曲水流觞，好不自在！偶尔来过一过凡人的生活，也是不错的！","曲水流觞，好不自在！偶尔来过一过凡人的生活，也是不错的！",null,0,0,0,0,[26],0,0],[38,"我是上帝！小友的庄园好生漂亮，就是缺了一角，可惜可惜","我是上帝！小友的庄园好生漂亮，就是缺了一角，可惜可惜",null,0,0,0,0,[27],0,0],[39,"哈哈哈，可以可以。我在车站旁的雨棚上藏了一本魔法书，拿来给我，我就为你补齐！","哈哈哈，可以可以。我在小镇的屋顶上藏了一本魔法书，拿来给我，我就为你补齐！",null,0,0,0,0,[28],0,0],[40,"跳跃吧，去拿魔法书吧！","跳跃吧，去拿魔法书吧！",null,0,0,0,0,null,0,0],[41,"你竟然真的把魔法书带来了，给我看看！","你竟然真的把魔法书带来了，给我看看！",null,0,0,0,0,[29,30],0,0],[42,"精修魔法，我们还会再见","精修魔法，我们还会再见",null,0,0,0,0,null,0,0],[43,"先完成其他任务哦","先完成其他任务哦",null,0,0,0,0,null,0,0],[44,"魔法书在车站旁雨棚上哦！","魔法书在车站旁雨棚上哦！",null,5,1,0,0,null,0,0],[45,"小友的飞行魔法掌握的炉火纯青！我这就兑现诺言...","小友的飞行魔法掌握的炉火纯青！我这就兑现诺言...",null,5,2,0,0,null,0,0],[46,"巴拉巴拉能量—歪比巴卜—变！！！","巴拉巴拉能量—歪比巴卜--变！！！",[4,9,14],0,0,0,0,null,0,0],[47,"大海听我号令—海神魔法—变！！！","大海听我号令—海神魔法—变！！！",[5,10,15],0,0,0,0,null,0,0],[48,"兽之呼吸第九式—创造再生！！！","兽之呼吸第九式—创造再生！！！",[1,6,11],0,0,0,0,null,0,0],[49,"太上老君急急如律令—变！！！","太上老君急急如律令—变！！！",[2,7,12],0,0,0,0,null,0,0],[50,"众神听我号令—啊啊啊！！！","众神听我号令—啊啊啊！！！",[3,8,13],0,0,0,0,null,0,0]];
export interface INPCTalkElement extends IElementBase{
 	/**qid*/
	ID:number
	/**索引多语言表的语言*/
	language:string
	/**重新选择建筑*/
	buildings:Array<number>
	/**任务线ID*/
	taskLineId:number
	/**任务状态：1=领取任务 2=提交任务*/
	taskState:number
	/**好感度变化*/
	goodWill:number
	/**NPC的下一句对话*/
	nextTalk:number
	/**是否需要玩家对话（写玩家对话事件）*/
	playerTalk:Array<number>
	/**跳过对话事件*/
	jumpTalk:number
	/**是否隐藏跳过对话按钮*/
	hide:number
 } 
export class NPCTalkConfig extends ConfigBase<INPCTalkElement>{
	constructor(){
		super(EXCELDATA);
	}

}